{
  "description": "Past and Present Projects",
  "projects": [
    {
      "title": "eliconnelly.com (NextJS)",
      "image": "nextjs-profile.png",
      "url": "https://github.com/econnelly/eli-profile",
      "category": "react",
      "description": "This is the site you're currently on. It is a meant to showcase projects I've worked on as well as give me a little deeper understanding of web technologies. It's built using NextJS 13 to statically create everything. In general, that means the site is pure HTML and Javascript without any databases or dynamic content. Even blog posts start as markdown and get converted to HTML."
    },
    {
      "title": "eliconnelly.com (Gatsby)",
      "image": "gatsby-profile.png",
      "url": "https://github.com/econnelly/eli-profile-gatsby",
      "category": "react",
      "description": "My previous portfolio site was created in the Gatsby framework. It was a great way to learn about graphql, but the next iteration used a more modern framework."
    },
    {
      "title": "Tachometer (Discontinued)",
      "image": "logo-speed-color.png",
      "url": "https://github.com/tachometer-io",
      "category": "ruby on rails",
      "description": "This was a way for me to build a very useful utility for myself and other developers who make money through ad revenue. The system would fetch ad revenue reports, standardize the values, and create a custom report revenue. I used it daily and wanted to make it available for other developers as well."
    },
    {
      "title": "ESP32 Stock Ticker",
      "image": "stock_ticker.jpg",
      "url": "https://github.com/econnelly/esp32-stock-ticker",
      "category": "esp32",
      "description": "This project was a way for me to learn how to use the display that comes with the LILYGO T-Display-S3 device. It's an ESP32-S3 with a 1.9-inch TFT display. This project reads a json file that I posted to a webserver on my local network. The file contains the stock price of Google for the last 5 days. The device reads the file and displays a graph of the data. "
    }
  ]
}